Revit 2024 API
View.GetWorksharingDisplayMode Method
 Gets the current worksharing display mode for this view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public WorksharingDisplayMode GetWorksharingDisplayMode()
Visual Basic
Public Function GetWorksharingDisplayMode As WorksharingDisplayMode
Visual C++
public:
WorksharingDisplayMode GetWorksharingDisplayMode()
Return Value
 The active worksharing display mode in this view.
Remarks
 Returns "Off" if no worksharing display mode is currently enabled.
See Also
View Class
Autodesk.Revit.DB Namespace